In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
#df.drop(["Name", "Sex", "Ticket", "Cabin", "Embarked"], axis = 1, inplace = True)
df

     PassengerId  Survived  Pclass        Age  SibSp  Parch     Fare
0              1         0       3  22.000000      1      0   7.2500
1              2         1       1  38.000000      1      0  71.2833
2              3         1       3  26.000000      0      0   7.9250
3              4         1       1  35.000000      1      0  53.1000
4              5         0       3  35.000000      0      0   8.0500
..           ...       ...     ...        ...    ...    ...      ...
886          887         0       2  27.000000      0      0  13.0000
887          888         1       1  19.000000      0      0  30.0000
888          889         0       3  29.699118      1      2  23.4500
889          890         1       1  26.000000      0      0  30.0000
890          891         0       3  32.000000      0      0   7.7500

[891 rows x 7 columns]

In [20]:
df.fillna(df.mean(), inplace=True)

In [24]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
dtype: int64

In [27]:
df.drop(["PassengerId"], axis = 1, inplace = True)
df.head()

   Survived  Pclass   Age  SibSp  Parch     Fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [49]:
data = ["Pclass", "SibSp", "Parch", "Fare", "Age"]
label = "Survived"

x = df[data]
y = df[label]
print(x)
print(y)

     Pclass  SibSp  Parch     Fare        Age
0         3      1      0   7.2500  22.000000
1         1      1      0  71.2833  38.000000
2         3      0      0   7.9250  26.000000
3         1      1      0  53.1000  35.000000
4         3      0      0   8.0500  35.000000
..      ...    ...    ...      ...        ...
886       2      0      0  13.0000  27.000000
887       1      0      0  30.0000  19.000000
888       3      1      2  23.4500  29.699118
889       1      0      0  30.0000  26.000000
890       3      0      0   7.7500  32.000000

[891 rows x 5 columns]
0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [50]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(verbose = 1)
model.fit(x, y)

RUNNING THE L-BFGS-B CODE

           * * *

Machine precision = 2.220D-16
 N =            6     M =           10

At X0         0 variables are exactly at the bounds

At iterate    0    f=  6.17594D+02    |proj g|=  3.46693D+03

At iterate   50    f=  5.17108D+02    |proj g|=  1.62329D+00

           * * *

[Parallel(n_jobs=1)]: Using backend SequentialBackend with 1 concurrent workers.
 This problem is unconstrained.
[Parallel(n_jobs=1)]: Done   1 out of   1 | elapsed:    0.0s finished

LogisticRegression(verbose=1)

Tit   = total number of iterations
Tnf   = total number of function evaluations
Tnint = total number of segments explored during Cauchy searches
Skip  = number of BFGS updates skipped
Nact  = number of active bounds at final generalized Cauchy point
Projg = norm of the final projected gradient
F     = final function value

           * * *

   N    Tit     Tnf  Tnint  Skip  Nact     Projg        F
    6     57     63      1     0     0   1.433D-02   5.171D+02
  F =   517.10717442176451

CONVERGENCE: REL_REDUCTION_OF_F_<=_FACTR*EPSMCH

In [43]:
test = pd.read_csv("test.csv")
test_with_ID = test.copy()
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [45]:
test.drop(["Name", "Sex", "Ticket", "Cabin", "Embarked", "PassengerId"], axis = 1, inplace = True)
test_with_ID.drop(["Name", "Sex", "Ticket", "Cabin", "Embarked"], axis = 1, inplace = True)
test.fillna(test.mean(), inplace=True)
test.head()
test.isnull().sum()

Pclass    0
Age       0
SibSp     0
Parch     0
Fare      0
dtype: int64

In [47]:
test_with_ID.isnull().sum()

PassengerId     0
Pclass          0
Age            86
SibSp           0
Parch           0
Fare            1
dtype: int64

In [53]:
data_test = ["Pclass", "SibSp", "Parch", "Fare", "Age"]
data_pred = test[data_test]

In [55]:
output = model.predict(data_pred)

In [56]:
test_with_ID.PassengerId

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [63]:
joined_data = list(zip(test_with_ID.PassengerId, output))

In [67]:
create_new_dataframe = pd.DataFrame(joined_data, columns = ["PassengerId", "Survived"])

In [70]:
create_new_dataframe.to_csv("ml_predictions_of_survival.csv", index=False)